---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallTaperedWidthAtTop
source: html/62e64f23-2644-1cc5-6432-cb3aaa0db463.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallTaperedWidthAtTop Property

"Top Width"

## Syntax (C#)
```csharp
public static ForgeTypeId WallTaperedWidthAtTop { get; }
```